app/controllers/api/v1/admin_controller.rb

SELECT "users".* FROM "users" WHERE (user_type NOT IN (10))
---
  def index
    begin
      @userlist = User.where('user_type NOT IN (?)', 10)